---
kind: enumMember
id: F:Autodesk.Revit.UI.Macros.UIDocumentMacroOptions.Prompt
enum: Autodesk.Revit.UI.Macros.UIDocumentMacroOptions
zh: 提示、弹窗、消息框
source: html/58b01732-d76b-ea31-8dd6-a2da7c90106d.htm
---
# Autodesk.Revit.UI.Macros.UIDocumentMacroOptions.Prompt

**中文**: 提示、弹窗、消息框

To prompt a dialog to ask the options during document opening.